dots/emacs/1_chemacs_testing/test/chemacs/config/emacs/config.org
#+author: Benjamin Dunstan
#+title: asynthe's Emacs Config

_note_: do not add code blocks to show examples, as this will be taken by the emacs-lisp code block and mess with your config.
_note_: remember to run "all-the-icons-install-fonts" if doing a new install.

- *TODO HARFBUZZ*
- take stuff from DT and your DOOM config
- TEST STRAIGHT.el
[[https://github.com/radian-software/straight.el][github page]]

* PACKAGE MANAGER / SYSTEM
** Ignore Beep

#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)
#+end_src

** Setup package.el to work with MELPA.

#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives
'("melpa" . "https://melpa.org/packages/"))
(package-refresh-contents)
(package-initialize)
#+end_src

** Installling use-package

#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(setq use-package-always-ensure t)
#+end_src

** DELETE SELECTED TEXT

#+begin_src emacs-lisp
(delete-selection-mode t)
#+end_src

* PACKAGES
** ALL-THE-ICONS
 all the icons for all your packages and apps.
 remember to install them with all-the-icons-install

 #+begin_src emacs-lisp
 (use-package all-the-icons)
 #+end_src

** DASHBOARD 
 the main page of your emacs!
 
 #+begin_src emacs-lisp
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
  ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
  (setq dashboard-startup-banner "~/.emacs.d/blackhole.png")  ;; use custom image as banner
  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
			      (bookmarks . "book"))))
 #+end_src

for *Emacsclient* too
#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

** DIRED
this package is used for this 

#+begin_src emacs-lisp
(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)

(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
               "d d" '(dired :which-key "Open dired")
               "d j" '(dired-jump :which-key "Dired jump to current")
               "d p" '(peep-dired :which-key "Peep-dired"))

(with-eval-after-load 'dired
  ;;(define-key dired-mde-map (kbd "M-p") 'peep-dired)
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
  (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
  (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; Auto-refresh dired on file change
(add-hook 'dired-mode-hook 'auto-revert-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "nsxiv")
                               ("jpg" . "nsxiv")
                              ("png" . "nsxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

** DOOM MODELINE
 [[https://github.com/seagle0128/doom-modeline][github page - doom-modeline]]
 [[https://github.com/hlissner/emacs-hide-mode-line][github page - hide-mode-line]]
 
 the bar where you see on the bottom of the window.

 #+begin_src emacs-lisp
 (use-package doom-modeline)
 (doom-modeline-mode 1)
 ;; + BATTERY
 (display-battery-mode 1)

 ;; hide the modeline with hide-mode-line-mode
 ;;(use-package hide-mode-line)
 ;;(require 'hide-mode-line)
 ;; some hooks for stuff in which we don't want use modeline in
 ;;(add-hook 'completion-list-mode-hook #'hide-mode-line-mode)
 ;;(add-hook 'neotree-mode-hook #'hide-mode-line-mode)
 #+end_src

** EMOJIFY (display emojis)

#+begin_src emacs-lisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src

** EVIL MODE
 it's VIM, on EMACS!

 #+begin_src emacs-lisp
(setq evil-want-keybinding nil) ;; specified by the evil-colletion log
(use-package evil
  :init      ;; tweak evil's configuration before loading it
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  ;;(setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode))
(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer))
  (evil-collection-init))
;;(use-package evil-tutor)
 #+end_src

** ESHELL

#+begin_src emacs-lisp
(nvmap :prefix "SPC"
     "e h"   '(counsel-esh-history :which-key "Eshell history")
     "e s"   '(eshell :which-key "Eshell"))
#+end_src

** GENERAL (to set up keybindings)
 this allow us to set keybindings w "General.el"
 #+begin_src emacs-lisp
 (use-package general
 :config
 (general-evil-setup t))
 #+end_src

** PROJECTILE

#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-global-mode 1))
#+end_src

** SUPER-SAVE
[[https://github.com/bbatsov/super-save][github page]]

#+begin_src emacs-lisp
(unless (package-installed-p 'super-save)
  (package-refresh-contents)
  (package-install 'super-save))

(super-save-mode +1)
(setq super-save-auto-save-when-idle t)
(setq auto-save-default nil)
#+end_src

** LANGUAGE SUPPORT 

#+begin_src emacs-lisp
(use-package haskell-mode)
(use-package lua-mode)
(use-package markdown-mode)
#+end_src

** IVY

#+begin_src emacs-lisp
(use-package counsel
  :after ivy
  :config (counsel-mode))
(use-package ivy
  :defer 0.1
  :diminish
  :bind
  (("C-c C-r" . ivy-resume)
   ("C-x B" . ivy-switch-buffer-other-window))
  :custom
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  :config
  (ivy-mode))
(use-package ivy-rich
  :after ivy
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer)
  (ivy-rich-mode 1)) ;; this gets us descriptions in M-x.
(use-package swiper
  :after ivy
  :bind (("C-s" . swiper)
         ("C-r" . swiper)))
#+end_src

#+begin_src emacs-lisp
(setq ivy-initial-inputs-alist nil)
#+end_src

*** Smex

#+begin_src emacs-lisp
(use-package smex)
(smex-initialize)
#+end_src

** PROJECTILE

#+begin_src emacs-lisp
      (use-package projectile
    :config
  (projectile-global-mode 1))
#+end_src

** ESHELL

#+begin_src emacs-lisp
(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

(setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
      eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
#+end_src

** TOC (Table of Contents)
have an up-to-date table of contents in org files without exporting 
(useful useful for README files on GitHub).
Use :TOC: to create the table.

#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

