dots/emacs/1_chemacs_testing/test/chemacs/config/emacs/config.org
** VERTICO

#+begin_src emacs-lisp
;; Enable vertico
(use-package vertico
  :init
  (vertico-mode)

  ;; Different scroll margin
  ;; (setq vertico-scroll-margin 0)

  ;; Show more candidates
  ;; (setq vertico-count 20)

  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  ;; (setq vertico-cycle t)
  )

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t))
#+end_src

** WHICH KEY
 that buffer menu you see when you press a combination of keys and wait for some seconds.

 #+begin_src emacs-lisp
 (use-package which-key
  :init
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → " ))
(which-key-mode)
 #+end_src

** WRITEROOM MODE

#+begin_src emacs-lisp
(use-package writeroom-mode)
#+end_src

** POMODORO

#+begin_src emacs-lisp
(use-package org-pomodoro)
#+end_src

** NOT YET SET PACKAGES 
*** UNICODE (?)
* KEYBINDINGS
** MAIN KEYBINDINGS

 #+begin_src emacs-lisp
 (nvmap :keymaps 'override :prefix "SPC"
	"SPC"   '(counsel-M-x :which-key "M-x")
	"c c"   '(compile :which-key "Compile")
	"c C"   '(recompile :which-key "Recompile")
	"h r r" '((lambda () (interactive) (load-file "~/.emacs.default/init.el")) :which-key "Reload emacs config")
	"t t"   '(toggle-truncate-lines :which-key "Toggle truncate lines")
	"m *"   '(org-ctrl-c-star :which-key "Org-ctrl-c-star")
	"m +"   '(org-ctrl-c-minus :which-key "Org-ctrl-c-minus")
	"m ."   '(counsel-org-goto :which-key "Counsel org goto")
	"m e"   '(org-export-dispatch :which-key "Org export dispatch")
	"m f"   '(org-footnote-new :which-key "Org footnote new")
	"m h"   '(org-toggle-heading :which-key "Org toggle heading")
	"m i"   '(org-toggle-item :which-key "Org toggle item")
	"m n"   '(org-store-link :which-key "Org store link")
	"m o"   '(org-set-property :which-key "Org set property")
	"m t"   '(org-todo :which-key "Org todo")
	"m x"   '(org-toggle-checkbox :which-key "Org toggle checkbox")
	"m B"   '(org-babel-tangle :which-key "Org babel tangle")
	"m I"   '(org-toggle-inline-images :which-key "Org toggle inline imager"))
	"m T"   '(org-todo-list :which-key "Org todo list")
	;;"o a"   '(org-agenda :which-key "Org agenda")
 #+end_src
 
** FILE COMMANDS

#+begin_src emacs-lisp
(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
       "."     '(find-file :which-key "Find file")
       "b l"     '(+vertico/switch-workspace-buffer :which-key "Switch workspace")
       "m"     '(org-switchb :which-key "Switch workspace")
       "f f"   '(fnd-file :which-key "Find file")
       "f r"   '(counsel-recentf :which-key "Recent files")
       "f s"   '(save-buffer :which-key "Save file")
       "f u"   '(sudo-edit-find-file :which-key "Sudo find file")
       "f y"   '(dt/show-and-copy-buffer-path :which-key "Yank file path")
       "f C"   '(copy-file :which-key "Copy file")
       "f D"   '(delete-file :which-key "Delete file")
       "f R"   '(rename-file :which-key "Rename file")
       "f S"   '(write-file :which-key "Save file as...")
       "f U"   '(sudo-edit :which-key "Sudo edit file")
#+end_src

#+begin_src emacs-lisp
       (nvmap :prefix "SPC"
       "n r m" #'(lambda () (interactive) (find-file "~/sync/notes/org/main.org")))
#+end_src
       ;;:desc "Completion at point"
       ;;"n r c" #'completion-at-point
       ;;:desc "Dailies today"
       ;;"n r ." #'org-roam-dailies-goto-today
       ;;:desc "Dailies find date"
       ;;"n r ," #'org-roam-dailies-goto-date
       ;;:desc "Journal new entry"
       ;;"n r j" #'org-journal-new-entry
       ;;:desc "Agenda"
       ;;"n r z" #'org-agenda
       ;;:desc "Tasks file"
       ;;"n r c" #'(lambda () (interactive) (find-file "~/sync/notes/org/irl/daily/tasks.org"))
       ;;:desc "Events file"
       ;;"n r x" #'(lambda () (interactive) (find-file "~/sync/notes/org/irl/daily/events.org")))

** ORG

;;#+begin_src emacs-lisp
;;(nvmap 
;;  :bind (("C-c n l" . org-roam-buffer-toggle)
;;         ("C-c n f" . org-roam-node-find)
;;         ("C-c n g" . org-roam-graph)
;;         ("C-c n i" . org-roam-node-insert)
;;         ("C-c n c" . org-roam-capture)
;;         ;; Dailies
;;         ("C-c n j" . org-roam-dailies-capture-today)))
;;#+end_src

** BUFFER MOVEMENT (Ibuffer)
moving through buffers and multitasking like a productivity machine.

#+begin_src emacs-lisp
(nvmap :prefix "SPC"
       "b i"   '(ibuffer :which-key "Ibuffer")
       "b c"   '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
       "b k"   '(kill-current-buffer :which-key "Kill current buffer")
       "b n"   '(next-buffer :which-key "Next buffer")
       "b p"   '(previous-buffer :which-key "Previous buffer")
       "b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
       "b K"   '(kill-buffer :which-key "Kill buffer"))
#+end_src

** ZOOM IN/OUT
 zoom in with ctrl + / zoom out with ctrl -

 #+begin_src emacs-lisp
 ;; zoom in/out like we do everywhere else.
 (global-set-key (kbd "C-=") 'text-scale-increase)
 (global-set-key (kbd "C--") 'text-scale-decrease)
 ;;(global-set-key (kbd "C-0") '(lambda () (interactive) (text-scale-adjust 0))) ;; return to default
 (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
 (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
 #+end_src

* GRAPHICAL USER INTERFACE SETTINGS
** FONTS
 I just love iosevka uppercase, and some good japanese font for me writing.

 #+begin_src emacs-lisp
  (set-face-attribute 'default nil
	    :font "Iosevka 16"
            :height 110
	    :weight 'regular)
  (set-face-attribute 'variable-pitch nil
	    :font "Iosevka 16"
	    :height 120
	    :weight 'regular)
  (set-face-attribute 'fixed-pitch nil
	    :font "Iosevka 16"
	    :height 110
	    :weight 'regular)
 ;; Makes commented text and keywords italics.
 ;; This is working in emacsclient but not emacs.
 ;; Your font must have an italic face available.
 (set-face-attribute 'font-lock-comment-face nil
   :slant 'italic)
 (set-face-attribute 'font-lock-keyword-face nil
   :slant 'italic)

  ;; Uncomment the following line if line spacing needs adjusting.
  ;;(setq-default line-spacing 0.10)

  ;; Needed if using emacs client. Otherwise, your fonts will be smaller than expected.
  (add-to-list 'default-frame-alist '(font . "Iosevka 16"))
 #+end_src

** SYSTEM INTERFACE 
*** menu, toolbar and scroll bar

 #+begin_src emacs-lisp
 (menu-bar-mode -1)
 (tool-bar-mode -1)
 (scroll-bar-mode -1)
 #+end_src

 - enable disable mode-line w a keybinding!
 - disable global-hl-line mode
 - numbering line
 - mode-line

 - left space
 and buffer w normal space

*** line numbers and truncated lines

 #+begin_src emacs-lisp
 ;; LINE STYLE AND NUMBERING
 (setq display-line-numbers-type nil)
 ;;(global-display-line-numbers-mode nil)

 ;; LINE VISUAL STYLE
 (setq global-hl-line-mode nil)
 (setq hl-line-mode nil)
 ;;(setq global-visual-line-mode nil) 

 ;; FRINGE
 ;; color line on the left or right border
 (setq fringe-mode nil)
 #+end_src
 
