dots/emacs/1_chemacs_testing/test/chemacs/config/emacs/config.org
** SPLITS AND WINDOWS
cool stuff, hacker mode

#+begin_src emacs-lisp
(winner-mode 1)
(nvmap :prefix "SPC"
       ;; Window splits
       "w c"   '(evil-window-delete :which-key "Close window")
       "w n"   '(evil-window-new :which-key "New window")
       "w s"   '(evil-window-split :which-key "Horizontal split window")
       "w v"   '(evil-window-vsplit :which-key "Vertical split window")
       ;; Window motions
       "w h"   '(evil-window-left :which-key "Window left")
       "w j"   '(evil-window-down :which-key "Window down")
       "w k"   '(evil-window-up :which-key "Window up")
       "w l"   '(evil-window-right :which-key "Window right")
       "w w"   '(evil-window-next :which-key "Goto next window")
       ;; winner mode
       "w <left>"  '(winner-undo :which-key "Winner undo")
       "w <right>" '(winner-redo :which-key "Winner redo"))
#+end_src

** THEME
 your main theme, show them colors.
 #+begin_src emacs-lisp
 (use-package doom-themes)
 (setq doom-themes-enable-bold t)     ; if nil, bold is disabled
 (setq doom-themes-enable-italic t)   ; if nil, italics is disabled
 (load-theme 'doom-one t)
 #+end_src

** SCROLLING

#+begin_src emacs-lisp
(setq scroll-conservatively 101) ;; value greater than 100 gets rid of half page jumping
(setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; how many lines at a time
(setq mouse-wheel-progressive-speed t) ;; accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
#+end_src

* ORG
** ORG CONFIGURATION
*** MAIN CONFIG

    #+begin_src emacs-lisp
    (add-hook 'org-mode-hook 'org-indent-mode)
    (setq org-directory "~/sync/notes/org/"
	  org-log-done 'time
;; Org styling, hide markup etc.
org-hide-emphasis-markers t
org-pretty-entities t
org-ellipsis " … ")
;; from DT
;;(setq org-src-preserve-indentation nil
;;		org-src-tab-acts-natively t
;;		org-edit-src-content-indentation 0)
    #+end_src

*** ORG AGENDA

    #+begin_src emacs-lisp
    (setq org-agenda-files '("~/sync/notes/org/irl/daily")
	  ;;org-agenda-include-diary t
	  org-agenda-block-separator 8411
	  org-agenda-start-on-weekday nil
	  org-agenda-start-day "-3d"
	  org-agenda-span 15)
    #+end_src

*** ORG JOURNAL

 #+begin_src emacs-lisp
 (setq org-journal-dir "~/sync/notes/org/other/me/journal"
       org-journal-date-prefix "#+TITLE: "
       org-journal-time-prefix "* "
       org-journal-date-format "%a, %d-%m-%Y"
       org-journal-file-format "%Y-%m-%d.org")
 #+end_src

*** ORG-CYCLE (TAB FOR CLOSING AND OPENING)

#+begin_src emacs-lisp
(setq org-cycle-emulate-tab t)
#+end_src

*** ORG TODO KEYWORDS

#+begin_src emacs-lisp
(setq org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
       '((sequence
          "TODO(t)"           ; A task that is ready to be tackled
          "BLOG(b)"           ; Blog writing assignments
          "PROJ(p)"           ; A project that contains other tasks
          "WAIT(w)"           ; Something is holding up this task
          "|"                 ; The pipe necessary to separate "active" states and "inactive" states
          "DONE(d)"           ; Task has been completed
          "CANCELLED(c)" )))  ; Task has been cancelled 
#+end_src

*** SOURCE CODE BLOCK
**** BLOCK TAG

 #+begin_src emacs-lisp
 (use-package org-tempo
   :ensure nil) ;; tell use-package not to try to install org-tempo since it's already there.
 #+end_src

**** SYNTAX HIGHLIGHTING

 #+begin_src emacs-lisp
 (setq org-src-fontify-natively t
     org-src-tab-acts-natively t
     org-confirm-babel-evaluate nil
     org-edit-src-content-indentation 0)
 #+end_src
** ORG ROAM

#+begin_src emacs-lisp
(use-package org-roam)
(setq org-roam-directory "~/sync/notes/org")
  ;;:config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  ;;(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  ;; If using org-roam-protocol
  ;;  (require 'org-roam-protocol)
#+end_src

** ORG EXPORT TO MANPAGE

#+begin_src emacs-lisp
    (use-package ox-man
  :ensure nil)
#+end_src

** ORG MODERN
[[https://github.com/minad/org-modern][github page]]

#+begin_src emacs-lisp
(use-package org-modern)
(add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

(global-org-modern-mode)
#+end_src

** NOT SET UP YET
*** ORG LINK ABBREVIATIONS

;;#+begin_src emacs-lisp
;; An example of how this works.
;; [[arch-wiki:Name_of_Page][Description]]
;;(setq org-link-abbrev-alist    ; This overwrites the default Doom ;;org-link-abbrev-list
;;        '(("google" . "http://www.google.com/search?q=")
;;          ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
;;          ("ddg" . "https://duckduckgo.com/?q=")
;;          ("wiki" . "https://en.wikipedia.org/wiki/")))
;;#+end_src

* PERFORMANCE
** GARBAGE COLLECTION

#+begin_src emacs-lisp
;; Using garbage magic hack.
 (use-package gcmh
   :config
   (gcmh-mode 1))
;; Setting garbage collection threshold
(setq gc-cons-threshold 402653184
      gc-cons-percentage 0.6)

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; Silence compiler warnings as they can be pretty disruptive
(setq comp-async-report-warnings-errors nil)
#+end_src

** NATIVE COMPILATION

#+begin_src emacs-lisp
;; Silence compiler warnings as they can be pretty disruptive
(if (boundp 'comp-deferred-compilation)
    (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))
;; In noninteractive sessions, prioritize non-byte-compiled source files to
;; prevent the use of stale byte-code. Otherwise, it saves us a little IO time
;; to skip the mtime checks on every *.elc file.
(setq load-prefer-newer noninteractive)
#+end_src

* JAPANESE

* NOT WORKING

** VTERM
;;#+begin_src emacs-lisp
;;(use-package vterm)
;;#+end_src

** ORG BULLETS -> ORG MODERN
attractive bullets rather than asterisks.

;;#+begin_src emacs-lisp
;;(require 'org-bullets)
;;(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
;;#+end_src
** ORG APPEAR
 [[https://github.com/awth13/org-appear][github page]]

 #+begin_src emacs-lisp
(use-package org-appear)
(add-hook org-mode :append #'org-appear-mode)
 #+end_src
